; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_1 ?v4 - type_3 ?v6 - type_2)
 	      (pred_2 ?v8 - object ?v6 - type_2)
	      (pred_3 ?v4 - type_3 ?v1 - type_1)
	      (pred_4 ?v4 - type_3 ?v8 - object ?v1 - type_1))

   (:action op_3
       :parameters  (?v4 - type_3 ?v3 ?v5 - type_2)
       :precondition (and  (pred_1 ?v4 ?v3))
       :effect (and  (pred_1 ?v4 ?v5)
		     (not (pred_1 ?v4 ?v3))))

   (:action op_1
       :parameters (?v4 - type_3 ?v2 - object ?v7 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v2 ?v7) (pred_1 ?v4 ?v7) (pred_3 ?v4 ?v1))
       :effect (and (pred_4 ?v4 ?v2 ?v1)
		    (not (pred_2 ?v2 ?v7)) 
		    (not (pred_3 ?v4 ?v1))))

   (:action op_2
       :parameters (?v4 - type_3 ?v2 - object ?v7 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_4 ?v4 ?v2 ?v1) (pred_1 ?v4 ?v7))
       :effect (and (pred_2 ?v2 ?v7)
		    (pred_3 ?v4 ?v1)
		    (not (pred_4 ?v4 ?v2 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_02 obj_10 - type_3
obj_04 obj_07 obj_12 obj_11 - type_1
obj_03 obj_06 obj_08 obj_13 - type_2
obj_01 obj_05 obj_14 obj_09 - object)
(:init
(pred_1 obj_02 obj_08)
(pred_3 obj_02 obj_04)
(pred_3 obj_02 obj_07)
(pred_1 obj_10 obj_13)
(pred_3 obj_10 obj_12)
(pred_3 obj_10 obj_11)
(pred_2 obj_01 obj_03)
(pred_2 obj_05 obj_13)
(pred_2 obj_14 obj_06)
(pred_2 obj_09 obj_13)
)
(:goal
(and
(pred_2 obj_01 obj_13)
(pred_2 obj_05 obj_13)
(pred_2 obj_14 obj_03)
(pred_2 obj_09 obj_03)
)
)

(:constraints
  (always (not (pred_1 obj_02 obj_13)))
)
)

; plan
1. (op_1 obj_10 obj_09 obj_13 obj_11)
   deleted: (pred_2 obj_09 obj_13) (pred_3 obj_10 obj_11)
   added: (pred_4 obj_10 obj_09 obj_11)
   goals met: 1 of 4
2. (op_3 obj_02 obj_08 obj_06)
   deleted: (pred_1 obj_02 obj_08)
   added: (pred_1 obj_02 obj_06)
   goals met: 1 of 4
3. (op_3 obj_10 obj_13 obj_03)
   deleted: (pred_1 obj_10 obj_13)
   added: (pred_1 obj_10 obj_03)
   goals met: 1 of 4
4. (op_1 obj_02 obj_14 obj_06 obj_07)
   deleted: (pred_2 obj_14 obj_06) (pred_3 obj_02 obj_07)
   added: (pred_4 obj_02 obj_14 obj_07)
   goals met: 1 of 4
5. (op_3 obj_02 obj_06 obj_03)
   deleted: (pred_1 obj_02 obj_06)
   added: (pred_1 obj_02 obj_03)
   goals met: 1 of 4
6. (op_2 obj_10 obj_09 obj_03 obj_11)
   deleted: (pred_4 obj_10 obj_09 obj_11)
   added: (pred_2 obj_09 obj_03) (pred_3 obj_10 obj_11)
   goals met: 2 of 4
7. (op_1 obj_10 obj_01 obj_03 obj_12)
   deleted: (pred_2 obj_01 obj_03) (pred_3 obj_10 obj_12)
   added: (pred_4 obj_10 obj_01 obj_12)
   goals met: 2 of 4
8. (op_3 obj_10 obj_03 obj_13)
   deleted: (pred_1 obj_10 obj_03)
   added: (pred_1 obj_10 obj_13)
   goals met: 2 of 4
9. (op_2 obj_02 obj_14 obj_03 obj_07)
   deleted: (pred_4 obj_02 obj_14 obj_07)
   added: (pred_2 obj_14 obj_03) (pred_3 obj_02 obj_07)
   goals met: 3 of 4
10. (op_2 obj_10 obj_01 obj_13 obj_12)
   deleted: (pred_4 obj_10 obj_01 obj_12)
   added: (pred_2 obj_01 obj_13) (pred_3 obj_10 obj_12)
   goals met: 4 of 4
